rtkconnectivity/RTL876x3E-Common-SDK/src/sample/bt_audio_trx/bredr/app_iap.c
/*
 * Copyright (c) 2026, Realtek Semiconductor Corporation
 *
 * SPDX-License-Identifier: LicenseRef-Realtek-5-Clause
 */

#if F_APP_IAP_SUPPORT
#include <string.h>
#include "trace.h"
#include "os_mem.h"
#include "os_queue.h"
#include "rtl876x.h"
#include "rtl876x_pinmux.h"
#include "rtl876x_rcc.h"
#include "rtl876x_i2c.h"
#include "platform_utils.h"
#include "sysm.h"
#include "bt_iap.h"
#include "bt_types.h"
#include "gap.h"
#include "iap_stream.h"
#include "app_main.h"
#include "app_cfg.h"
#include "app_bt_policy_cfg.h"
#include "app_iap.h"
#include "app_sdp.h"
#include "app_flags.h"

#if AMA_FEATURE_SUPPORT
#include "app_ama_transport.h"
#endif

//cp device address
#define CP_DEVICE_ADDRESS 0x10

#define MSG_BLUETOOTH_COMPONENT_INFO        0x4E01
#define MSG_START_BT_CONNECTION_UPDATES     0x4E03
#define MSG_BT_CONNECTION_UPDATE            0x4E04
#define MSG_STOP_BT_CONNECTION_UPDATES      0x4E05
#define MSG_START_CALL_STATE_UPDATES        0x4154
#define MSG_CALL_STATE_UPDATE               0x4155
#define MSG_STOP_CALL_STATE_UPDATES         0x4156
#define MSG_START_COMM_UPDATES              0x4157
#define MSG_MUTE_STATUS_UPDATE              0x4160

I2C_TypeDef *p_i2c_cp = I2C0;

typedef struct t_remote_info
{
    uint32_t info_num;
    T_APP_IAP infos[MAX_BR_LINK_NUM];
} T_REMOTE_INFO;

typedef enum t_relay_msg
{
    REMOTE_SINGLE_SYNC  = 0,
    REMOTE_SYNC_ALL     = 1,
    MSG_MAX             = 2,
} T_RELAY_MSG;

static struct
{
    T_OS_QUEUE queue;
} app_iap_mgr;

T_APP_IAP *app_iap_search_by_addr(uint8_t bd_addr[6])
{
    T_APP_IAP *p_info = (T_APP_IAP *)app_iap_mgr.queue.p_first;

    for (; p_info != NULL; p_info = p_info->p_next)
    {
        if (memcmp(p_info->bd_addr, bd_addr, 6) == 0)
        {
            return p_info;
        }
    }

    return NULL;
}

void app_iap_cp_hw_init(void *p_i2c)
{
    p_i2c_cp = (I2C_TypeDef *)p_i2c;

    //initilize GPIO PINs
    I2C_InitTypeDef I2C_InitStructure = {0};

    //Init I2C

    if (p_i2c_cp == I2C0)
    {
        RCC_PeriphClockCmd(APBPeriph_I2C0, APBPeriph_I2C0_CLOCK, ENABLE);
    }

    if (p_i2c_cp == I2C1)
    {
        RCC_PeriphClockCmd(APBPeriph_I2C1, APBPeriph_I2C1_CLOCK, ENABLE);
    }

    /* I2C configuration */
    I2C_StructInit(&I2C_InitStructure);
    I2C_InitStructure.I2C_ClockSpeed = 400000;
    I2C_InitStructure.I2C_DeviveMode = I2C_DeviveMode_Master;
    I2C_InitStructure.I2C_AddressMode = I2C_AddressMode_7BIT;
    I2C_InitStructure.I2C_SlaveAddress = CP_DEVICE_ADDRESS;
    I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;

    /* I2C module Initialize */
    I2C_Init(p_i2c_cp, &I2C_InitStructure);
    /* I2C Peripheral Enable */
    I2C_Cmd(p_i2c_cp, ENABLE);

    I2C_INTConfig(p_i2c_cp, I2C_INT_TX_ABRT, ENABLE);
}

static bool app_iap_cp_check_i2c_flag(uint32_t flag)
{
    FlagStatus flag_status = RESET;
    volatile uint16_t retry_count = 1000;

    while (retry_count)
    {
        flag_status = I2C_GetFlagState(p_i2c_cp, flag);
        if (flag_status == SET)
        {
            //APP_PRINT_TRACE1("app_cp_check_i2c_flag: retry_count %d", retry_count);
            return true;
        }
        else
        {
            retry_count--;
        }
    }

    APP_PRINT_ERROR0("app_iap_cp_check_i2c_flag: 2 CP_CAUSE_TIMEOUT");
    return false;
}

static bool app_iap_cp_write(uint8_t start_addr, uint8_t *data, uint16_t length)
{
    int32_t ret = 0;
    uint8_t no_ack;
    uint16_t i, j;

    APP_PRINT_TRACE0("app_iap_cp_write");

    if (p_i2c_cp == NULL)
    {
        ret = 1;
        goto TAG_END;
    }

    I2C_SetSlaveAddress(p_i2c_cp, CP_DEVICE_ADDRESS);
    j = 100;

    //write device address(W) & start register address
    do
    {
        no_ack = 0;
        if (length == 0)
        {
            p_i2c_cp->IC_DATA_CMD = start_addr | (1 << 9);
        }
        else
        {
            p_i2c_cp->IC_DATA_CMD = start_addr;
        }

        //wait tx fifo empty
        if (app_iap_cp_check_i2c_flag(I2C_FLAG_TFE) == false)
        {
            ret = 2;
            goto TAG_END;
        }

        i = 200; //can not too short!!!!!
        while (1)
        {
            no_ack = I2C_CheckEvent(p_i2c_cp, ABRT_7B_ADDR_NOACK);
            i--;
            if (no_ack == 1 || i == 0)
            {
                break;
            }
        }

        if (no_ack)
        {
            //clear ABRT_7B_ADDR_NOACK bit
            I2C_ClearINTPendingBit(p_i2c_cp, I2C_INT_TX_ABRT);
            //delay min 500us and retry
            platform_delay_us(500);
            j--;
            if (j == 0)
            {
                break;
            }
        }
    }

    while (no_ack);

    //write data
    if (length > 0 && data != NULL)
    {
        while (length > 1)
        {
            p_i2c_cp->IC_DATA_CMD = *data++;
            //wait tx fifo empty
            if (app_iap_cp_check_i2c_flag(I2C_FLAG_TFE) == false)
            {
                ret = 3;
                goto TAG_END;
            }

            length--;
        }

        //stop
        p_i2c_cp->IC_DATA_CMD = ((*data++) | (1 << 9));
        if (app_iap_cp_check_i2c_flag(I2C_FLAG_TFE) == false)
        {
            ret = 4;
            goto TAG_END;
        }

    }

    return true;

TAG_END:
    APP_PRINT_TRACE1("app_iap_cp_write: ret: %d", -ret);
    return false;
}

static bool app_iap_cp_burst_read(uint8_t start_addr, uint8_t *pbuf, uint16_t length)
{
    int32_t ret = 0;
    uint8_t no_ack = 0;
    uint16_t i, j;

    APP_PRINT_TRACE0("app_iap_cp_burst_read");

    if (p_i2c_cp == NULL)
    {
        ret = 1;
        goto TAG_END;
    }

    //write start register address
    if (app_iap_cp_write(start_addr, NULL, 0) == false)
    {
        ret = 2;
        goto TAG_END;
    }

    I2C_SetSlaveAddress(p_i2c_cp, CP_DEVICE_ADDRESS);

    //read command
    j = 100;

    do
    {
        no_ack = 0;
        if (length == 1)
        {
            /* genarate stop signal */
            p_i2c_cp->IC_DATA_CMD = ((0x00) | (1 << 8) | (1 << 9));
        }
        else
        {
            p_i2c_cp->IC_DATA_CMD = (0x00) | (1 << 8);
        }

        //wait tx fifo empty
        if (app_iap_cp_check_i2c_flag(I2C_FLAG_TFE) == false)
        {
            ret = 3;
            goto TAG_END;
        }

        i = 100;
        while (1)
        {
            no_ack = I2C_CheckEvent(p_i2c_cp, ABRT_7B_ADDR_NOACK);
            i--;
            if (no_ack == 1 || i == 0)
            {
                break;
            }
        }

