rtkconnectivity/RTL876x3E-Common-SDK/src/sample/bt_audio_trx/bredr/app_iap.c
        if (no_ack)
        {
            //clear ABRT_7B_ADDR_NOACK bit
            I2C_ClearINTPendingBit(p_i2c_cp, I2C_INT_TX_ABRT);
            //delay min 500us and retry
            platform_delay_us(500);
            j--;
            if (j == 0)
            {
                break;
            }
        }
    }

    while (no_ack);

    while (length > 1)
    {
        if (length == 2)
        {
            /* genarate stop signal */
            p_i2c_cp->IC_DATA_CMD = ((0x00) | (1 << 8) | (1 << 9));
        }
        else
        {
            p_i2c_cp->IC_DATA_CMD = (0x00) | (1 << 8);
        }

        //wait rx fifo data
        if (app_iap_cp_check_i2c_flag(I2C_FLAG_RFNE) == false)
        {
            ret = 4;
            goto TAG_END;
        }

        *pbuf++ = I2C_ReceiveData(p_i2c_cp);
        length--;
    }

    //wait rx fifo data, last byte
    if (app_iap_cp_check_i2c_flag(I2C_FLAG_RFNE) == false)
    {
        ret = 5;
        goto TAG_END;
    }

    *pbuf++ = (uint8_t)p_i2c_cp->IC_DATA_CMD;

    return true;

TAG_END:
    APP_PRINT_TRACE1("app_iap_cp_burst_read: ret %d", -ret);
    return false;
}

static void app_iap_send_ident_info(uint8_t *bd_addr)
{
    uint8_t *p_buf;
    uint8_t *p;
    uint8_t *p_head;

    p_buf = malloc(300);
    if (p_buf == NULL)
    {
        return;
    }

    APP_PRINT_TRACE1("app_iap_send_ident_info: p_buf %p", p_buf);

    p_head = p_buf;

    p_buf = bt_iap2_prep_param(p_buf, BT_IAP_ID_NAME, (void *)app_cfg_nv.device_name_legacy,
                               strlen((const char *)app_cfg_nv.device_name_legacy) + 1);

    char mudule_identifier[] = "1.0";
    p_buf = bt_iap2_prep_param(p_buf, BT_IAP_ID_MODEL_IDENTIFIER, mudule_identifier,
                               sizeof(mudule_identifier));

    char manufacturer[] = "realtek";
    p_buf = bt_iap2_prep_param(p_buf, BT_IAP_ID_MANUFACTURER, manufacturer, sizeof(manufacturer));

    char serial_num[] = "1.0";
    p_buf = bt_iap2_prep_param(p_buf, BT_IAP_ID_SERIAL_NUMBER, serial_num, sizeof(serial_num));

    char fw_version[6] = "1.0.0";
    p_buf = bt_iap2_prep_param(p_buf, BT_IAP_ID_FIRMWARE_VERSION, fw_version, sizeof(fw_version));

    char hw_version[6] = "2.0.0";
    p_buf = bt_iap2_prep_param(p_buf, BT_IAP_ID_HARDWARE_VERSION, hw_version, sizeof(hw_version));

    uint8_t msg_sent_by_accessory[8];
    p = msg_sent_by_accessory;
    BE_UINT16_TO_STREAM(p, MSG_BLUETOOTH_COMPONENT_INFO);
    BE_UINT16_TO_STREAM(p, MSG_START_BT_CONNECTION_UPDATES);
    BE_UINT16_TO_STREAM(p, MSG_STOP_BT_CONNECTION_UPDATES);
    BE_UINT16_TO_STREAM(p, BT_IAP_MSG_EA_PROTOCOL_SESSION_STATUS);
    //BE_UINT16_TO_STREAM(p, MSG_START_CALL_STATE_UPDATES);
    //BE_UINT16_TO_STREAM(p, MSG_STOP_CALL_STATE_UPDATES);
    //BE_UINT16_TO_STREAM(p, MSG_MUTE_STATUS_UPDATE);
    p_buf = bt_iap2_prep_param(p_buf, BT_IAP_ID_MESSAGES_SENT_BY_ACCESSORY, msg_sent_by_accessory,
                               sizeof(msg_sent_by_accessory));

    uint8_t msg_received_from_device[6];
    p = msg_received_from_device;
    BE_UINT16_TO_STREAM(p, BT_IAP_MSG_START_EA_PROTOCOL_SESSION);
    BE_UINT16_TO_STREAM(p, BT_IAP_MSG_STOP_EA_PROTOCOL_SESSION);
    BE_UINT16_TO_STREAM(p, MSG_BT_CONNECTION_UPDATE);
    //BE_UINT16_TO_STREAM(p, BT_IAP_MSG_EA_PROTOCOL_SESSION_STATUS);
    //BE_UINT16_TO_STREAM(p, MSG_CALL_STATE_UPDATE);
    p_buf = bt_iap2_prep_param(p_buf, BT_IAP_ID_MESSAGES_RECEIVED_FROM_DEVICE, msg_received_from_device,
                               sizeof(msg_received_from_device));

    //ID_POWER_SOURCETYPE
    uint8_t power_source = 0;
    p_buf = bt_iap2_prep_param(p_buf, BT_IAP_ID_POWER_SOURCETYPE, &power_source, sizeof(power_source));

    //ID_MAXIMUM_CURRENT_DRAWN_FROM_DEVICE

    uint16_t max_current_drawn_from_device = 0;
    p_buf = bt_iap2_prep_param(p_buf, BT_IAP_ID_MAXIMUM_CURRENT_DRAWN_FROM_DEVICE,
                               &max_current_drawn_from_device,
                               sizeof(max_current_drawn_from_device));


#if F_APP_IAP_RTK_SUPPORT
    //Supported EA protocol group
    {
        uint8_t *p = p_buf;
        p_buf = bt_iap2_prep_param(p_buf, BT_IAP_ID_SUPPORTED_EXTERNAL_ACCESSORY_PROTOCOL, NULL, 0);

        //group : EA_PROTOCOL_ID
        uint8_t ea_protocol_id = EA_PROTOCOL_ID_RTK;
        p_buf = bt_iap2_prep_param(p_buf, BT_IAP_EXT_ACC_PROTOCOL_ID, &ea_protocol_id,
                                   sizeof(ea_protocol_id));

        char ea_protocol_name[] = "com.rtk.datapath";
        p_buf = bt_iap2_prep_param(p_buf, BT_IAP_EXT_ACC_PROTOCOL_NAME, ea_protocol_name,
                                   sizeof(ea_protocol_name));

        //group EA_PROTOCOL_MATCHACTION
        uint8_t ea_protocol_match_action = 0x02;
        p_buf = bt_iap2_prep_param(p_buf, BT_IAP_EXT_ACC_PROTOCOL_MATCHACTION, &ea_protocol_match_action,
                                   sizeof(ea_protocol_match_action));

        //calculate total Length
        uint16_t total_len = p_buf - p;
        BE_UINT16_TO_STREAM(p, total_len);
    }
#endif

    //ID_PREFERRED_APP_MATCH_TEAM_ID
    char app_match_team_id[] = "C6P64J2MZX";
    p_buf = bt_iap2_prep_param(p_buf, BT_IAP_ID_PREFERRED_APP_MATCH_TEAM_ID, app_match_team_id,
                               sizeof(app_match_team_id));

    //ID_CURRENT_LANGUAGE
    char current_language[] = "en";
    p_buf = bt_iap2_prep_param(p_buf, BT_IAP_ID_CURRENT_LANGUAGE, current_language,
                               sizeof(current_language));

    //ID_SUPPORTED_LANGUAGE
    char supported_language[] = "en";
    p_buf = bt_iap2_prep_param(p_buf, BT_IAP_ID_SUPPORTED_LANGUAGE, &supported_language,
                               sizeof(supported_language));

    //BT_COMPONENT_ID group
    {
        uint8_t *p = p_buf;
        p_buf = bt_iap2_prep_param(p_buf, BT_IAP_ID_BLUETOOTH_TRANSPORT_COMPONENT, NULL, 0);

        //group : BT_COMPONENT_ID

        uint16_t component_id = 0x5442;
        p_buf = bt_iap2_prep_param(p_buf, BT_IAP_TRANSPORT_COMPONENT_IDENTIFIER, &component_id,
                                   sizeof(component_id));

