rtkconnectivity/RTL876x3E-Common-SDK/src/sample/bt_audio_trx/bredr/app_iap.c
        //group TRANSPORT_COMPONENT_NAME
        char acc_name[] = "component_name";
        p_buf = bt_iap2_prep_param(p_buf, BT_IAP_TRANSPORT_COMPONENT_NAME, acc_name, sizeof(acc_name));

        //group TRANSPORT_SUPPORTS_IAP2_CONNECTION
        p_buf = bt_iap2_prep_param(p_buf, BT_IAP_TRANSPORT_SUPPORTS_IAP2_CONNECTION, NULL, 0);

        uint8_t local_bt_addr[6] = {0x00};
        uint8_t mac_addr[6] = {0x00};
        gap_get_param(GAP_PARAM_BD_ADDR, local_bt_addr);
        mac_addr[0] = local_bt_addr[5];
        mac_addr[1] = local_bt_addr[4];
        mac_addr[2] = local_bt_addr[3];
        mac_addr[3] = local_bt_addr[2];
        mac_addr[4] = local_bt_addr[1];
        mac_addr[5] = local_bt_addr[0];
        p_buf = bt_iap2_prep_param(p_buf, BT_IAP_BLUETOOTH_TRANSPORT_MEDIA_ACCESS_CONTROL_ADDRESS, mac_addr,
                                   sizeof(mac_addr));

        //calculate total Length
        uint16_t total_len = p_buf - p;
        BE_UINT16_TO_STREAM(p, total_len);
    }

    //param hid component
    {
#if 0
        BE_UINT16_TO_STREAM(p, IAP2_PARA_HDR_SIZE + IAP2_PARA_HDR_SIZE + 2 + IAP2_PARA_HDR_SIZE + sizeof(
                                acc_iap2_hid_comp_name) + IAP2_PARA_HDR_SIZE + 1);
        BE_UINT16_TO_STREAM(p, ID_IAP2_HID_COMPONENT);

        BE_UINT16_TO_STREAM(p, IAP2_PARA_HDR_SIZE + 2);
        BE_UINT16_TO_STREAM(p, IAP2_HID_COMPONENT_IDENTIFIER);
        BE_UINT16_TO_STREAM(p, HID_COMPONENT_ID);

        BE_UINT16_TO_STREAM(p, IAP2_PARA_HDR_SIZE + sizeof(acc_iap2_hid_comp_name));
        BE_UINT16_TO_STREAM(p, IAP2_HID_COMPONENT_NAME);
        ARRAY_TO_STREAM(p, acc_iap2_hid_comp_name, sizeof(acc_iap2_hid_comp_name));

        BE_UINT16_TO_STREAM(p, IAP2_PARA_HDR_SIZE + 1);
        BE_UINT16_TO_STREAM(p, IAP2_HID_COMPONENT_FUNCTION);
        BE_UINT8_TO_STREAM(p, HID_COMPONENT_FUNC_MEDIA_PLAYBACK_REMOTE);
#endif
    }

    //ID_PRODUCT_PLAN_UID
    char product_plan_uid[] = "d82bb2d497d51b45";
    p_buf = bt_iap2_prep_param(p_buf, BT_IAP_ID_PRODUCT_PLAN_UID, &product_plan_uid,
                               sizeof(product_plan_uid));

    APP_PRINT_TRACE2("app_iap_send_ident_info: p_buf %p, p_head %p", p_buf, p_head);

    bt_iap_ident_info_send(bd_addr, p_head, p_buf - p_head);
    free(p_head);
}

static void app_iap_get_bddr_by_bt_param(T_BT_EVENT event_type, T_BT_EVENT_PARAM *param,
                                         uint8_t *bd_addr)
{
    uint8_t *tmp_bd_addr = NULL;

    switch (event_type)
    {
    case BT_EVENT_IAP_AUTHEN_CMPL:
        tmp_bd_addr = param->iap_authen_cmpl.bd_addr;
        break;

    case BT_EVENT_IAP_DATA_SESSION_OPEN:
        tmp_bd_addr = param->iap_authen_cmpl.bd_addr;
        break;

    case BT_EVENT_IAP_DATA_SESSION_CLOSE:
        tmp_bd_addr = param->iap_data_session_close.bd_addr;
        break;

    case BT_EVENT_IAP_DATA_SENT:
        tmp_bd_addr = param->iap_data_sent.bd_addr;
        break;

    case BT_EVENT_IAP_CONN_IND:
        tmp_bd_addr = param->iap_conn_ind.bd_addr;
        break;

    case BT_EVENT_IAP_CONN_FAIL:
        tmp_bd_addr = param->iap_conn_fail.bd_addr;
        break;

    case BT_EVENT_IAP_CONN_CMPL:
        tmp_bd_addr = param->iap_conn_cmpl.bd_addr;
        break;

    case BT_EVENT_IAP_DATA_IND:
        tmp_bd_addr = param->iap_data_ind.bd_addr;
        break;

    case BT_EVENT_IAP_IDENTITY_INFO_REQ:
        tmp_bd_addr = param->iap_identity_info_req.bd_addr;
        break;

    case BT_EVENT_IAP_DISCONN_CMPL:
        tmp_bd_addr = param->iap_disconn_cmpl.bd_addr;
        break;

    case BT_EVENT_IAP_CTRL_MSG_IND:
        tmp_bd_addr = param->iap_ctrl_msg_ind.bd_addr;
        break;

    default:
        break;
    }

    if (tmp_bd_addr)
    {
        memcpy(bd_addr, tmp_bd_addr, 6);
    }

    return;
}

static void app_iap_single_remote_send(T_APP_IAP *p_iap, T_BT_EVENT evt)
{

}

static void app_iap_bt_cback(T_BT_EVENT event_type, void *event_buf, uint16_t buf_len)
{
    T_BT_EVENT_PARAM *param = event_buf;
    bool handle = true;
    static bool bt_comp_info_send_flag = false;
    T_APP_IAP *p_iap = NULL;
    uint8_t bd_addr[6] = {0};

    app_iap_get_bddr_by_bt_param(event_type, param, bd_addr);
    p_iap = app_iap_search_by_addr(bd_addr);

    switch (event_type)
    {
    case BT_EVENT_IAP_AUTHEN_CMPL:
        {
            if (p_iap)
            {
                if (param->iap_authen_cmpl.result == true)
                {
                    bt_comp_info_send_flag = true;
#if 0
                    char boundle_id[] = "com.realtek.EADemo2";
                    T_BT_IAP_APP_LAUNCH_METHOD method = BT_IAP_APP_LAUNCH_WITH_USER_ALERT;
                    bt_iap_launch_app(param->iap_authen_cmpl.bd_addr, boundle_id, sizeof(boundle_id), method);
#endif
                    p_iap->authen_flag = true;
                }
                else
                {
                    APP_PRINT_ERROR0("BT_EVENT_IAP_AUTHEN_CMPL fail");
                    p_iap->authen_flag = false;
                }

                app_iap_single_remote_send(p_iap, event_type);
            }
        }
        break;

    case BT_EVENT_IAP_DATA_SESSION_OPEN:
        {
            if (p_iap)
            {
                if (bt_comp_info_send_flag == true)
                {
                    bt_comp_info_send_flag = false;
                    bt_iap_comp_info_send(param->iap_data_session_open.bd_addr, 0x4254, true);
                }

                bt_iap_conn_update_start(param->iap_data_session_open.bd_addr, 0x4254);

                app_iap_single_remote_send(p_iap, event_type);

#if F_APP_IAP_RTK_SUPPORT | AMA_FEATURE_SUPPORT
                T_IAP_STREAM_EVENT_PARAM iap_stream_param;

                memcpy(iap_stream_param.bd_addr, param->iap_data_session_open.bd_addr, 6);
                iap_stream_param.eap_session_id = param->iap_data_session_open.session_id;
                iap_stream_param.connect_param.ea_protocol_id = param->iap_data_session_open.protocol_id;
                iap_stream_param.connect_param.mtu = p_iap->frame_size;
                iap_stream_param.connect_param.remote_credits = 20;
                iap_stream_event_process(IAP_STREAM_CONNECT_EVENT, &iap_stream_param);
#endif
            }
        }
        break;

    case BT_EVENT_IAP_DATA_SESSION_CLOSE:
        {
            if (p_iap)
            {
                app_iap_single_remote_send(p_iap, event_type);

