rtkconnectivity/RTL876x3E-Common-SDK/src/sample/bt_audio_trx/bredr/app_iap.c
#if F_APP_IAP_RTK_SUPPORT | AMA_FEATURE_SUPPORT
                T_IAP_STREAM_EVENT_PARAM iap_stream_param;

                memcpy(iap_stream_param.bd_addr, param->iap_data_session_close.bd_addr, 6);
                iap_stream_param.eap_session_id = param->iap_data_session_close.session_id;
                iap_stream_param.disconnect_param.disc_all = false;
                iap_stream_event_process(IAP_STREAM_DISCONNECT_EVENT, &iap_stream_param);
#endif
            }
        }
        break;

    case BT_EVENT_IAP_CONN_IND:
        {
            if (!p_iap)
            {
                p_iap = calloc(1, sizeof(*p_iap));
                p_iap->frame_size = param->iap_conn_ind.frame_size;
                memcpy(p_iap->bd_addr, bd_addr, 6);
                os_queue_in(&app_iap_mgr.queue, p_iap);
                bt_iap_connect_cfm(param->iap_conn_ind.bd_addr, true, param->iap_conn_ind.frame_size, 7);
                app_iap_single_remote_send(p_iap, event_type);
            }
        }
        break;

    case BT_EVENT_IAP_CONN_FAIL:
        {
            if (p_iap)
            {
                os_queue_delete(&app_iap_mgr.queue, p_iap);
                app_iap_single_remote_send(p_iap, event_type);
                free(p_iap);
            }
        }
        break;

    case BT_EVENT_IAP_CONN_CMPL:
        {
            static uint8_t recur_cnt = 0;

            recur_cnt++;
            if (recur_cnt > 3)
            {
                APP_PRINT_ERROR0("app_iap_bt_cback: iap conn cannot recur called too much");
                recur_cnt = 0;
                break;
            }

            if (p_iap == NULL)
            {
                APP_PRINT_WARN0("app_iap_bt_cback: IAP_CONN_CMPL create a info");
                p_iap = calloc(1, sizeof(*p_iap));
                memcpy(p_iap->bd_addr, bd_addr, 6);
                os_queue_in(&app_iap_mgr.queue, p_iap);
                p_iap->frame_size = param->iap_conn_cmpl.frame_size;
                app_iap_single_remote_send(p_iap, event_type);
            }
            else
            {
                T_BT_EVENT_PARAM tmp_param = {};

                memcpy(tmp_param.iap_disconn_cmpl.bd_addr, bd_addr, 6);
                tmp_param.iap_disconn_cmpl.cause = HCI_ERR | HCI_ERR_TIMEOUT;
                app_iap_bt_cback(BT_EVENT_IAP_DISCONN_CMPL, &tmp_param, sizeof(tmp_param));
                app_iap_bt_cback(event_type, event_buf, buf_len);
            }
            recur_cnt--;
        }
        break;

    case BT_EVENT_IAP_DATA_IND:
        {
            APP_PRINT_INFO4("app_iap_bt_cback: DM_EVENT_BT_IAP_DATA_IND eap_session_id %d, dev_seq_num %d, len %d, p_data %b",
                            param->iap_data_ind.eap_session_id,
                            param->iap_data_ind.dev_seq_num,
                            param->iap_data_ind.len,
                            TRACE_BINARY(param->iap_data_ind.len, param->iap_data_ind.p_data));

            bt_iap_ack_send(param->iap_data_ind.bd_addr, param->iap_data_ind.dev_seq_num);
#if F_APP_IAP_RTK_SUPPORT | AMA_FEATURE_SUPPORT
            T_IAP_STREAM_EVENT_PARAM iap_stream_param;

            memcpy(iap_stream_param.bd_addr, param->iap_data_ind.bd_addr, 6);
            iap_stream_param.eap_session_id = param->iap_data_ind.eap_session_id;
            iap_stream_param.receive_data_param.data      = param->iap_data_ind.p_data;
            iap_stream_param.receive_data_param.length    = param->iap_data_ind.len;
            iap_stream_param.receive_data_param.credits   = 0;
            iap_stream_event_process(IAP_STREAM_RECEIVE_DATA_EVENT, &iap_stream_param);
#endif
        }
        break;

    case BT_EVENT_IAP_IDENTITY_INFO_REQ:
        {
            app_iap_send_ident_info(bd_addr);
        }
        break;

    case BT_EVENT_IAP_DISCONN_CMPL:
        {
            if (p_iap)
            {
                if (param->iap_disconn_cmpl.cause != (HCI_ERR | HCI_ERR_CONN_ROLESWAP))
                {
                    p_iap->authen_flag = false;
                    os_queue_delete(&app_iap_mgr.queue, p_iap);
                    app_iap_single_remote_send(p_iap, event_type);
                    free(p_iap);
                }
#if F_APP_IAP_RTK_SUPPORT | AMA_FEATURE_SUPPORT
                T_IAP_STREAM_EVENT_PARAM iap_stream_param = {0};

                memcpy(iap_stream_param.bd_addr, bd_addr, 6);
                iap_stream_param.disconnect_param.disc_all = true;
                iap_stream_param.disconnect_param.cause = param->iap_disconn_cmpl.cause;
                iap_stream_event_process(IAP_STREAM_DISCONNECT_EVENT, &iap_stream_param);
#endif
            }
        }
        break;

    case BT_EVENT_IAP_CTRL_MSG_IND:
        {
            APP_PRINT_INFO2("app_iap_bt_cback: BT_EVENT_IAP_CTRL_MSG_IND msg id 0x%04x, param len %d",
                            param->iap_ctrl_msg_ind.msg_id,
                            param->iap_ctrl_msg_ind.param_len);
        }
        break;

    default:
        {
            handle = false;
        }
        break;
    }

    if (handle == true)
    {
        APP_PRINT_INFO2("app_iap_bt_cback: event_type 0x%04x, bd_addr %s", event_type,
                        TRACE_BDADDR(bd_addr));
    }
}

static void app_iap_sync_single_info(T_APP_IAP *p_info)
{
    APP_PRINT_TRACE5("app_iap_sync_single_info: evt 0x%04x, bd_addr %s, frame_size %d, credit %d, authen_flag %d",
                     p_info->bt_event, TRACE_BDADDR(p_info->bd_addr), p_info->frame_size, p_info->credit,
                     p_info->authen_flag);

    T_APP_IAP *exist_pinfo = app_iap_search_by_addr(p_info->bd_addr);

    switch (p_info->bt_event)
    {
    case BT_EVENT_IAP_CONN_IND:
    case BT_EVENT_IAP_CONN_CMPL:
        if (exist_pinfo == NULL)
        {
            exist_pinfo = calloc(1, sizeof(*exist_pinfo));
            memcpy(exist_pinfo, p_info, sizeof(*exist_pinfo));
            os_queue_in(&app_iap_mgr.queue, exist_pinfo);
        }
        break;

    case BT_EVENT_IAP_DISCONN_CMPL:
    case BT_EVENT_IAP_CONN_FAIL:
        os_queue_delete(&app_iap_mgr.queue, exist_pinfo);
        free(exist_pinfo);
        break;

