rtkconnectivity/RTL876x3E-Common-SDK/src/sample/bt_audio_trx/bredr/app_iap.c
    case BT_EVENT_IAP_AUTHEN_CMPL...BT_EVENT_IAP_DATA_SENT:
    case BT_EVENT_IAP_IDENTITY_INFO_REQ...BT_EVENT_IAP_CTRL_MSG_IND:
        if (exist_pinfo)
        {
            T_APP_IAP *tmp = exist_pinfo->p_next;
            memcpy(exist_pinfo, p_info, sizeof(*exist_pinfo));
            exist_pinfo->p_next = tmp;
        }
        break;

    default:
        break;
    }
}

static void app_iap_sync_all_info(T_REMOTE_INFO *p_rmt_info)
{
    uint32_t cnt = app_iap_mgr.queue.count;

    for (uint32_t i = 0; i < cnt; i++)
    {
        T_APP_IAP *p_iap = os_queue_out(&app_iap_mgr.queue);
        free(p_iap);
    }

    cnt = p_rmt_info->info_num;

    APP_PRINT_TRACE1("app_iap_sync_all_info: sync info num %d", cnt);

    for (uint32_t i = 0; i < cnt; i++)
    {
        T_APP_IAP *p_iap = calloc(1, sizeof(*p_iap));

        if (p_iap)
        {
            memcpy(p_iap, &p_rmt_info->infos[i], sizeof(*p_iap));
            os_queue_in(&app_iap_mgr.queue, p_iap);
        }
    }
}

static void app_iap_parse_cback(uint8_t msg_type, T_REMOTE_INFO *p_rmt_info, uint16_t len,
                                T_REMOTE_RELAY_STATUS status)
{
    if (status != REMOTE_RELAY_STATUS_ASYNC_RCVD)
    {
        return;
    }

    APP_PRINT_TRACE1("app_iap_parse_cback: msg_type %d", msg_type);

    switch (msg_type)
    {
    case REMOTE_SINGLE_SYNC:
        app_iap_sync_single_info(&p_rmt_info->infos[0]);
        break;

    case REMOTE_SYNC_ALL:
        app_iap_sync_all_info(p_rmt_info);
        break;

    default:
        break;
    }
}

void app_iap_handle_remote_conn_cmpl(void)
{

}



uint8_t app_iap_get_credit(T_APP_IAP *p_iap)
{
    if (p_iap)
    {
        return p_iap->credit;
    }

    return 0;
}

bool app_iap_is_authened(T_APP_IAP *p_iap)
{
    if (p_iap)
    {
        return p_iap->authen_flag;
    }

    return false;
}

uint16_t app_iap_get_frame_size(T_APP_IAP *p_iap)
{
    if (p_iap)
    {
        return p_iap->frame_size;
    }

    return 0;
}

void app_iap_init(void)
{
    os_queue_init(&app_iap_mgr.queue);

    if (app_cfg_const.supported_profile_mask & IAP_PROFILE_MASK)
    {
        bt_iap_init(RFC_IAP_CHANN_NUM, app_iap_cp_write, app_iap_cp_burst_read);
        bt_mgr_cback_register(app_iap_bt_cback);
    }
}
#endif

